app/controllers/cryptos_controller.rb

  def index
    @cryptos = Crypto.all
---
SELECT "cryptos".* FROM "cryptos"

  def create
    @crypto = Crypto.new(crypto_params)

    respond_to do |format|
      if @crypto.save
---
INSERT INTO "cryptos" ("symbol", "user_id", "cost_per", "amount_owned", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["symbol", "steam"], ["user_id", 1], ["cost_per", 4.5], ["amount_owned", 766.0], ["created_at", "2019-05-23 06:01:29.926555"], ["updated_at", "2019-05-23 06:01:29.926555"]]

  def update
    respond_to do |format|
      if @crypto.update(crypto_params)
---
UPDATE "cryptos" SET "cost_per" = ?, "updated_at" = ? WHERE "cryptos"."id" = ?  [["cost_per", 0.44], ["updated_at", "2019-05-24 15:55:19.281774"], ["id", 12]]

  def destroy
    @crypto.destroy
---
DELETE FROM "cryptos" WHERE "cryptos"."id" = ?  [["id", 8]]

    def set_crypto
      @crypto = Crypto.find(params[:id])
---
SELECT  "cryptos".* FROM "cryptos" WHERE "cryptos"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def correct_user
     @correct =current_user.cryptos.find_by(id: params[:id])
---
SELECT  "cryptos".* FROM "cryptos" WHERE "cryptos"."user_id" = ? AND "cryptos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 8], ["LIMIT", 1]]